T = int(input())

for _ in range(T):
    n = int(input())
    if n <= 1:
        print(n)
        continue
    cnt = [0] * 10
    # 建因數表
    for p in range(9, 1, -1):
        # 從cnt[9]跑到cnt[2], p是因數
        while n % p == 0:
            # 如果是因數的的話，加進cnt[]
            cnt[p] += 1
            n //= p
    # 如果有大於10的因數
    if n != 1:
        print(-1)
    else:
        ans = ""
        for p in range(2, 10):
            # 將因數轉成字串，然後乘上在陣列裡面的數字 e.g. 100 = 2 * 2 * 5 * 5 = 4 * 5 * 5 -> 455
            ans += str(p) * cnt[p]
        print(ans)
"""
以100為例
輸入1 -> 只有一個數字要去處理
n not <= 1 -> 跳到下一個迴圈(continue)
cnt = [0] * 10 -> cnt[] = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
p = 9 -> n % 9 != 0 -> 跳過
p = 8 -> n % 8 != 0 -> 跳過
p = 7 -> n % 7 != 0 -> 跳過
p = 6 -> n % 6 != 0 -> 跳過
p = 5 -> n % 5 == 0 -> cnt[5] += 1 -> cnt[] = [0, 0, 0, 0, 1, 0, 0, 0, 0, 0] -> n = 20
p = 5 -> n % 5 == 0 -> cnt[5] += 1 -> cnt[] = [0, 0, 0, 0, 2, 0, 0, 0, 0, 0] -> n = 4
p = 4 -> n % 4 == 0 -> cnt[4] += 1 -> cnt[] = [0, 0, 0, 1, 2, 0, 0, 0, 0, 0] -> n = 1
p = 3 -> n % 3 != 0 -> 跳過
p = 2 -> n % 2 != 0 -> 跳過
n == 1 -> 跳到下一個迴圈
ans = "" -> 空字串
p = 2 -> ans = "" * 0 -> ans = ""
p = 3 -> ans = "" * 0 -> ans = ""
p = 4 -> ans = "4" * 1 -> ans = "4"
p = 5 -> ans = "2" * 2 -> ans = "455"
p = 6 -> ans = "2" * 1 -> ans = "455"
p = 7 -> ans = "2" * 0 -> ans = "455"
p = 8 -> ans = "2" * 0 -> ans = "455"
p = 9 -> ans = "2" * 0 -> ans = "455"
print(ans) -> 455
"""
